## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 23 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                RESOURCE                                 |
|--------|-------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.superset_ecs_errors[&quot;celery-beat&quot;]`   |
|        | `aws_cloudwatch_log_metric_filter.superset_ecs_errors[&quot;celery-worker&quot;]` |
|        | `aws_cloudwatch_log_metric_filter.superset_ecs_errors[&quot;superset&quot;]`      |
|        | `aws_cloudwatch_metric_alarm.superset_ecs_errors[&quot;celery-beat&quot;]`        |
|        | `aws_cloudwatch_metric_alarm.superset_ecs_errors[&quot;celery-worker&quot;]`      |
|        | `aws_cloudwatch_metric_alarm.superset_ecs_errors[&quot;superset&quot;]`           |
|        | `aws_cloudwatch_metric_alarm.superset_ecs_high_cpu[&quot;celery-beat&quot;]`      |
|        | `aws_cloudwatch_metric_alarm.superset_ecs_high_cpu[&quot;celery-worker&quot;]`    |
|        | `aws_cloudwatch_metric_alarm.superset_ecs_high_cpu[&quot;superset&quot;]`         |
|        | `aws_cloudwatch_metric_alarm.superset_ecs_high_memory[&quot;celery-beat&quot;]`   |
|        | `aws_cloudwatch_metric_alarm.superset_ecs_high_memory[&quot;celery-worker&quot;]` |
|        | `aws_cloudwatch_metric_alarm.superset_ecs_high_memory[&quot;superset&quot;]`      |
|        | `aws_cloudwatch_metric_alarm.superset_load_balancer_healthy_hosts`      |
|        | `aws_cloudwatch_metric_alarm.superset_load_balancer_response_time`      |
|        | `aws_cloudwatch_metric_alarm.superset_load_balancer_unhealthy_hosts`    |
|        | `aws_cloudwatch_query_definition.superset_ecs_errors`                   |
|        | `aws_kms_key.cloudwatch_alerts`                                         |
|        | `aws_sns_topic.cloudwatch_alert_ok`                                     |
|        | `aws_sns_topic.cloudwatch_alert_warning`                                |
|        | `aws_sns_topic_policy.cloudwatch_alert_ok`                              |
|        | `aws_sns_topic_policy.cloudwatch_alert_warning`                         |
|        | `aws_sns_topic_subscription.cloudwatch_alert_ok`                        |
|        | `aws_sns_topic_subscription.cloudwatch_alert_warning`                   |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/cds-superset/actions/runs/11685875506).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.superset_ecs_errors["celery-beat"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "superset_ecs_errors" {
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/superset/celery-beat"
      + name           = "celery-beat-error"
      + pattern        = "[(w1=\"*ERROR*\") && w1!=\"*Error on OAuth authorize*\"]"

      + metric_transformation {
          + default_value = "0"
          + name          = "celery-beat-error"
          + namespace     = "superset"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.superset_ecs_errors["celery-worker"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "superset_ecs_errors" {
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/superset/celery-worker"
      + name           = "celery-worker-error"
      + pattern        = "[(w1=\"*ERROR*\") && w1!=\"*Error on OAuth authorize*\"]"

      + metric_transformation {
          + default_value = "0"
          + name          = "celery-worker-error"
          + namespace     = "superset"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.superset_ecs_errors["superset"] will be created
  + resource "aws_cloudwatch_log_metric_filter" "superset_ecs_errors" {
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/superset/superset"
      + name           = "superset-error"
      + pattern        = "[(w1=\"*ERROR*\") && w1!=\"*Error on OAuth authorize*\"]"

      + metric_transformation {
          + default_value = "0"
          + name          = "superset-error"
          + namespace     = "superset"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.superset_ecs_errors["celery-beat"] will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_ecs_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = ":warning: celery-beat errors logged over 1 minute."
      + alarm_name                            = "errors-celery-beat"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-beat-error"
      + namespace                             = "superset"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_ecs_errors["celery-worker"] will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_ecs_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = ":warning: celery-worker errors logged over 1 minute."
      + alarm_name                            = "errors-celery-worker"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "celery-worker-error"
      + namespace                             = "superset"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_ecs_errors["superset"] will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_ecs_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = ":warning: superset errors logged over 1 minute."
      + alarm_name                            = "errors-superset"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "superset-error"
      + namespace                             = "superset"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_ecs_high_cpu["celery-beat"] will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_ecs_high_cpu" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = ":warning: celery-beat high CPU use over 2 minutes."
      + alarm_name                            = "ecs-celery-beat-high-cpu"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "superset"
          + "ServiceName" = "celery-beat"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 120
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_ecs_high_cpu["celery-worker"] will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_ecs_high_cpu" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = ":warning: celery-worker high CPU use over 2 minutes."
      + alarm_name                            = "ecs-celery-worker-high-cpu"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "superset"
          + "ServiceName" = "celery-worker"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 120
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_ecs_high_cpu["superset"] will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_ecs_high_cpu" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = ":warning: superset high CPU use over 2 minutes."
      + alarm_name                            = "ecs-superset-high-cpu"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "superset"
          + "ServiceName" = "superset"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 120
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_ecs_high_memory["celery-beat"] will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_ecs_high_memory" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = ":warning: celery-beat high memory use over 2 minutes."
      + alarm_name                            = "ecs-celery-beat-high-memory"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "superset"
          + "ServiceName" = "celery-beat"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 120
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_ecs_high_memory["celery-worker"] will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_ecs_high_memory" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = ":warning: celery-worker high memory use over 2 minutes."
      + alarm_name                            = "ecs-celery-worker-high-memory"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "superset"
          + "ServiceName" = "celery-worker"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 120
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_ecs_high_memory["superset"] will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_ecs_high_memory" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = ":warning: superset high memory use over 2 minutes."
      + alarm_name                            = "ecs-superset-high-memory"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "superset"
          + "ServiceName" = "superset"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 120
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_load_balancer_healthy_hosts will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_load_balancer_healthy_hosts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = ":dumpster-fire: there are no healthy hosts for the Superset load balance in a 1 minute period."
      + alarm_name                            = "load-balancer-healthy-hosts"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "LoadBalancer" = "app/superset-prod/d9046c2b02959d94"
          + "TargetGroup"  = "targetgroup/superset-tg-e7w/eaf09e3d8dfbf70c"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "HealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_load_balancer_response_time will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_load_balancer_response_time" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = ":warning: response time for the Superset load balancer is greater than 1 second over 5 minutes."
      + alarm_name                            = "load-balancer-response-time"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 2
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + ok_actions                            = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "response_time"
          + return_data = true
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = {
                  + "LoadBalancer" = "app/superset-prod/d9046c2b02959d94"
                  + "TargetGroup"  = "targetgroup/superset-tg-e7w/eaf09e3d8dfbf70c"
                }
              + metric_name = "TargetResponseTime"
              + namespace   = "AWS/ApplicationELB"
              + period      = 60
              + stat        = "Average"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_cloudwatch_metric_alarm.superset_load_balancer_unhealthy_hosts will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_load_balancer_unhealthy_hosts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = ":warning: there are unhealthy Superset load balancer hosts in a 1 minute period."
      + alarm_name                            = "load-balancer-unhealthy-hosts"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "LoadBalancer" = "app/superset-prod/d9046c2b02959d94"
          + "TargetGroup"  = "targetgroup/superset-tg-e7w/eaf09e3d8dfbf70c"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_query_definition.superset_ecs_errors will be created
  + resource "aws_cloudwatch_query_definition" "superset_ecs_errors" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/ecs/superset/celery-beat",
          + "/aws/ecs/superset/celery-worker",
          + "/aws/ecs/superset/superset",
        ]
      + name                = "Superset - errors"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /ERROR/
            | sort @timestamp desc
            | limit 100
        EOT
    }

  # aws_kms_key.cloudwatch_alerts will be created
  + resource "aws_kms_key" "cloudwatch_alerts" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "SNS topic for CloudWatch alarm alerts"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::066023111852:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:Describe*",
                          + "kms:Decrypt*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.ca-central-1.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow_CloudWatch_for_CMK"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:Describe*",
                          + "kms:Decrypt*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "CloudwatchEvents"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

  # aws_sns_topic.cloudwatch_alert_ok will be created
  + resource "aws_sns_topic" "cloudwatch_alert_ok" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "cloudwatch-alert-ok"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic.cloudwatch_alert_warning will be created
  + resource "aws_sns_topic" "cloudwatch_alert_warning" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "cloudwatch-alert-warning"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_policy.cloudwatch_alert_ok will be created
  + resource "aws_sns_topic_policy" "cloudwatch_alert_ok" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "SNS:Subscribe",
                          + "SNS:SetTopicAttributes",
                          + "SNS:RemovePermission",
                          + "SNS:Receive",
                          + "SNS:Publish",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:GetTopicAttributes",
                          + "SNS:DeleteTopic",
                          + "SNS:AddPermission",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "AWS:SourceOwner" = "066023111852"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Default_Policy"
                    },
                  + {
                      + Action    = "sns:Publish"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Publish_statement"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_sns_topic_policy.cloudwatch_alert_warning will be created
  + resource "aws_sns_topic_policy" "cloudwatch_alert_warning" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "SNS:Subscribe",
                          + "SNS:SetTopicAttributes",
                          + "SNS:RemovePermission",
                          + "SNS:Receive",
                          + "SNS:Publish",
                          + "SNS:ListSubscriptionsByTopic",
                          + "SNS:GetTopicAttributes",
                          + "SNS:DeleteTopic",
                          + "SNS:AddPermission",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "AWS:SourceOwner" = "066023111852"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Default_Policy"
                    },
                  + {
                      + Action    = "sns:Publish"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "SNS_Publish_statement"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_sns_topic_subscription.cloudwatch_alert_ok will be created
  + resource "aws_sns_topic_subscription" "cloudwatch_alert_ok" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (sensitive value)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sns_topic_subscription.cloudwatch_alert_warning will be created
  + resource "aws_sns_topic_subscription" "cloudwatch_alert_warning" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (sensitive value)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "https"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 23 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.notify_data_export.aws_s3_bucket.this,
  on .terraform/modules/notify_data_export/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.superset_ecs_errors[\"celery-beat\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.superset_ecs_errors[\"celery-worker\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.superset_ecs_errors[\"superset\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.superset_ecs_high_cpu[\"celery-beat\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.superset_ecs_high_cpu[\"celery-worker\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.superset_ecs_high_cpu[\"superset\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.superset_ecs_high_memory[\"celery-beat\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.superset_ecs_high_memory[\"celery-worker\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.superset_ecs_high_memory[\"superset\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.superset_load_balancer_healthy_hosts"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.superset_load_balancer_response_time"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.superset_load_balancer_unhealthy_hosts"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.superset"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.cur_data_extract"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.notify"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.data_export"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_s3_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_athena_read"]
WARN - plan.json...
```

</details>
